** VGG13 on Imagenette2-160 Dataset **
Number of parameters: 18,860,362
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 128, 128]           1,792
       BatchNorm2d-2         [-1, 64, 128, 128]             128
              ReLU-3         [-1, 64, 128, 128]               0
            Conv2d-4         [-1, 64, 128, 128]          36,928
       BatchNorm2d-5         [-1, 64, 128, 128]             128
              ReLU-6         [-1, 64, 128, 128]               0
         MaxPool2d-7           [-1, 64, 64, 64]               0
            Conv2d-8          [-1, 128, 64, 64]          73,856
       BatchNorm2d-9          [-1, 128, 64, 64]             256
             ReLU-10          [-1, 128, 64, 64]               0
           Conv2d-11          [-1, 128, 64, 64]         147,584
      BatchNorm2d-12          [-1, 128, 64, 64]             256
             ReLU-13          [-1, 128, 64, 64]               0
        MaxPool2d-14          [-1, 128, 32, 32]               0
           Conv2d-15          [-1, 256, 32, 32]         295,168
      BatchNorm2d-16          [-1, 256, 32, 32]             512
             ReLU-17          [-1, 256, 32, 32]               0
           Conv2d-18          [-1, 256, 32, 32]         590,080
      BatchNorm2d-19          [-1, 256, 32, 32]             512
             ReLU-20          [-1, 256, 32, 32]               0
        MaxPool2d-21          [-1, 256, 16, 16]               0
           Conv2d-22          [-1, 512, 16, 16]       1,180,160
      BatchNorm2d-23          [-1, 512, 16, 16]           1,024
             ReLU-24          [-1, 512, 16, 16]               0
           Conv2d-25          [-1, 512, 16, 16]       2,359,808
      BatchNorm2d-26          [-1, 512, 16, 16]           1,024
             ReLU-27          [-1, 512, 16, 16]               0
        MaxPool2d-28            [-1, 512, 8, 8]               0
           Conv2d-29            [-1, 512, 8, 8]       2,359,808
      BatchNorm2d-30            [-1, 512, 8, 8]           1,024
             ReLU-31            [-1, 512, 8, 8]               0
           Conv2d-32            [-1, 512, 8, 8]       2,359,808
      BatchNorm2d-33            [-1, 512, 8, 8]           1,024
             ReLU-34            [-1, 512, 8, 8]               0
        MaxPool2d-35            [-1, 512, 4, 4]               0
           Linear-36                 [-1, 1024]       8,389,632
             ReLU-37                 [-1, 1024]               0
          Dropout-38                 [-1, 1024]               0
           Linear-39                 [-1, 1024]       1,049,600
             ReLU-40                 [-1, 1024]               0
          Dropout-41                 [-1, 1024]               0
           Linear-42                   [-1, 10]          10,250
================================================================
Total params: 18,860,362
Trainable params: 18,860,362
Non-trainable params: 0