** MobileNetV2 on CIFAR10 Dataset **
Number of parameters: 2,236,682
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 16, 16]             864
       BatchNorm2d-2           [-1, 32, 16, 16]              64
             ReLU6-3           [-1, 32, 16, 16]               0
             Fault-4           [-1, 32, 16, 16]               0
            Conv2d-5           [-1, 32, 16, 16]             288
       BatchNorm2d-6           [-1, 32, 16, 16]              64
             ReLU6-7           [-1, 32, 16, 16]               0
             Fault-8           [-1, 32, 16, 16]               0
            Conv2d-9           [-1, 16, 16, 16]             512
      BatchNorm2d-10           [-1, 16, 16, 16]              32
 InvertedResidual-11           [-1, 16, 16, 16]               0
           Conv2d-12           [-1, 96, 16, 16]           1,536
      BatchNorm2d-13           [-1, 96, 16, 16]             192
            ReLU6-14           [-1, 96, 16, 16]               0
            Fault-15           [-1, 96, 16, 16]               0
           Conv2d-16           [-1, 96, 16, 16]             864
      BatchNorm2d-17           [-1, 96, 16, 16]             192
            ReLU6-18           [-1, 96, 16, 16]               0
            Fault-19           [-1, 96, 16, 16]               0
           Conv2d-20           [-1, 24, 16, 16]           2,304
      BatchNorm2d-21           [-1, 24, 16, 16]              48
 InvertedResidual-22           [-1, 24, 16, 16]               0
           Conv2d-23          [-1, 144, 16, 16]           3,456
      BatchNorm2d-24          [-1, 144, 16, 16]             288
            ReLU6-25          [-1, 144, 16, 16]               0
            Fault-26          [-1, 144, 16, 16]               0
           Conv2d-27          [-1, 144, 16, 16]           1,296
      BatchNorm2d-28          [-1, 144, 16, 16]             288
            ReLU6-29          [-1, 144, 16, 16]               0
            Fault-30          [-1, 144, 16, 16]               0
           Conv2d-31           [-1, 24, 16, 16]           3,456
      BatchNorm2d-32           [-1, 24, 16, 16]              48
 InvertedResidual-33           [-1, 24, 16, 16]               0
           Conv2d-34          [-1, 144, 16, 16]           3,456
      BatchNorm2d-35          [-1, 144, 16, 16]             288
            ReLU6-36          [-1, 144, 16, 16]               0
            Fault-37          [-1, 144, 16, 16]               0
           Conv2d-38            [-1, 144, 8, 8]           1,296
      BatchNorm2d-39            [-1, 144, 8, 8]             288
            ReLU6-40            [-1, 144, 8, 8]               0
            Fault-41            [-1, 144, 8, 8]               0
           Conv2d-42             [-1, 32, 8, 8]           4,608
      BatchNorm2d-43             [-1, 32, 8, 8]              64
 InvertedResidual-44             [-1, 32, 8, 8]               0
           Conv2d-45            [-1, 192, 8, 8]           6,144
      BatchNorm2d-46            [-1, 192, 8, 8]             384
            ReLU6-47            [-1, 192, 8, 8]               0
            Fault-48            [-1, 192, 8, 8]               0
           Conv2d-49            [-1, 192, 8, 8]           1,728
      BatchNorm2d-50            [-1, 192, 8, 8]             384
            ReLU6-51            [-1, 192, 8, 8]               0
            Fault-52            [-1, 192, 8, 8]               0
           Conv2d-53             [-1, 32, 8, 8]           6,144
      BatchNorm2d-54             [-1, 32, 8, 8]              64
 InvertedResidual-55             [-1, 32, 8, 8]               0
           Conv2d-56            [-1, 192, 8, 8]           6,144
      BatchNorm2d-57            [-1, 192, 8, 8]             384
            ReLU6-58            [-1, 192, 8, 8]               0
            Fault-59            [-1, 192, 8, 8]               0
           Conv2d-60            [-1, 192, 8, 8]           1,728
      BatchNorm2d-61            [-1, 192, 8, 8]             384
            ReLU6-62            [-1, 192, 8, 8]               0
            Fault-63            [-1, 192, 8, 8]               0
           Conv2d-64             [-1, 32, 8, 8]           6,144
      BatchNorm2d-65             [-1, 32, 8, 8]              64
 InvertedResidual-66             [-1, 32, 8, 8]               0
           Conv2d-67            [-1, 192, 8, 8]           6,144
      BatchNorm2d-68            [-1, 192, 8, 8]             384
            ReLU6-69            [-1, 192, 8, 8]               0
            Fault-70            [-1, 192, 8, 8]               0
           Conv2d-71            [-1, 192, 4, 4]           1,728
      BatchNorm2d-72            [-1, 192, 4, 4]             384
            ReLU6-73            [-1, 192, 4, 4]               0
            Fault-74            [-1, 192, 4, 4]               0
           Conv2d-75             [-1, 64, 4, 4]          12,288
      BatchNorm2d-76             [-1, 64, 4, 4]             128
 InvertedResidual-77             [-1, 64, 4, 4]               0
           Conv2d-78            [-1, 384, 4, 4]          24,576
      BatchNorm2d-79            [-1, 384, 4, 4]             768
            ReLU6-80            [-1, 384, 4, 4]               0
            Fault-81            [-1, 384, 4, 4]               0
           Conv2d-82            [-1, 384, 4, 4]           3,456
      BatchNorm2d-83            [-1, 384, 4, 4]             768
            ReLU6-84            [-1, 384, 4, 4]               0
            Fault-85            [-1, 384, 4, 4]               0
           Conv2d-86             [-1, 64, 4, 4]          24,576
      BatchNorm2d-87             [-1, 64, 4, 4]             128
 InvertedResidual-88             [-1, 64, 4, 4]               0
           Conv2d-89            [-1, 384, 4, 4]          24,576
      BatchNorm2d-90            [-1, 384, 4, 4]             768
            ReLU6-91            [-1, 384, 4, 4]               0
            Fault-92            [-1, 384, 4, 4]               0
           Conv2d-93            [-1, 384, 4, 4]           3,456
      BatchNorm2d-94            [-1, 384, 4, 4]             768
            ReLU6-95            [-1, 384, 4, 4]               0
            Fault-96            [-1, 384, 4, 4]               0
           Conv2d-97             [-1, 64, 4, 4]          24,576
      BatchNorm2d-98             [-1, 64, 4, 4]             128
 InvertedResidual-99             [-1, 64, 4, 4]               0
          Conv2d-100            [-1, 384, 4, 4]          24,576
     BatchNorm2d-101            [-1, 384, 4, 4]             768
           ReLU6-102            [-1, 384, 4, 4]               0
           Fault-103            [-1, 384, 4, 4]               0
          Conv2d-104            [-1, 384, 4, 4]           3,456
     BatchNorm2d-105            [-1, 384, 4, 4]             768
           ReLU6-106            [-1, 384, 4, 4]               0
           Fault-107            [-1, 384, 4, 4]               0
          Conv2d-108             [-1, 64, 4, 4]          24,576
     BatchNorm2d-109             [-1, 64, 4, 4]             128
InvertedResidual-110             [-1, 64, 4, 4]               0
          Conv2d-111            [-1, 384, 4, 4]          24,576
     BatchNorm2d-112            [-1, 384, 4, 4]             768
           ReLU6-113            [-1, 384, 4, 4]               0
           Fault-114            [-1, 384, 4, 4]               0
          Conv2d-115            [-1, 384, 4, 4]           3,456
     BatchNorm2d-116            [-1, 384, 4, 4]             768
           ReLU6-117            [-1, 384, 4, 4]               0
           Fault-118            [-1, 384, 4, 4]               0
          Conv2d-119             [-1, 96, 4, 4]          36,864
     BatchNorm2d-120             [-1, 96, 4, 4]             192
InvertedResidual-121             [-1, 96, 4, 4]               0
          Conv2d-122            [-1, 576, 4, 4]          55,296
     BatchNorm2d-123            [-1, 576, 4, 4]           1,152
           ReLU6-124            [-1, 576, 4, 4]               0
           Fault-125            [-1, 576, 4, 4]               0
          Conv2d-126            [-1, 576, 4, 4]           5,184
     BatchNorm2d-127            [-1, 576, 4, 4]           1,152
           ReLU6-128            [-1, 576, 4, 4]               0
           Fault-129            [-1, 576, 4, 4]               0
          Conv2d-130             [-1, 96, 4, 4]          55,296
     BatchNorm2d-131             [-1, 96, 4, 4]             192
InvertedResidual-132             [-1, 96, 4, 4]               0
          Conv2d-133            [-1, 576, 4, 4]          55,296
     BatchNorm2d-134            [-1, 576, 4, 4]           1,152
           ReLU6-135            [-1, 576, 4, 4]               0
           Fault-136            [-1, 576, 4, 4]               0
          Conv2d-137            [-1, 576, 4, 4]           5,184
     BatchNorm2d-138            [-1, 576, 4, 4]           1,152
           ReLU6-139            [-1, 576, 4, 4]               0
           Fault-140            [-1, 576, 4, 4]               0
          Conv2d-141             [-1, 96, 4, 4]          55,296
     BatchNorm2d-142             [-1, 96, 4, 4]             192
InvertedResidual-143             [-1, 96, 4, 4]               0
          Conv2d-144            [-1, 576, 4, 4]          55,296
     BatchNorm2d-145            [-1, 576, 4, 4]           1,152
           ReLU6-146            [-1, 576, 4, 4]               0
           Fault-147            [-1, 576, 4, 4]               0
          Conv2d-148            [-1, 576, 2, 2]           5,184
     BatchNorm2d-149            [-1, 576, 2, 2]           1,152
           ReLU6-150            [-1, 576, 2, 2]               0
           Fault-151            [-1, 576, 2, 2]               0
          Conv2d-152            [-1, 160, 2, 2]          92,160
     BatchNorm2d-153            [-1, 160, 2, 2]             320
InvertedResidual-154            [-1, 160, 2, 2]               0
          Conv2d-155            [-1, 960, 2, 2]         153,600
     BatchNorm2d-156            [-1, 960, 2, 2]           1,920
           ReLU6-157            [-1, 960, 2, 2]               0
           Fault-158            [-1, 960, 2, 2]               0
          Conv2d-159            [-1, 960, 2, 2]           8,640
     BatchNorm2d-160            [-1, 960, 2, 2]           1,920
           ReLU6-161            [-1, 960, 2, 2]               0
           Fault-162            [-1, 960, 2, 2]               0
          Conv2d-163            [-1, 160, 2, 2]         153,600
     BatchNorm2d-164            [-1, 160, 2, 2]             320
InvertedResidual-165            [-1, 160, 2, 2]               0
          Conv2d-166            [-1, 960, 2, 2]         153,600
     BatchNorm2d-167            [-1, 960, 2, 2]           1,920
           ReLU6-168            [-1, 960, 2, 2]               0
           Fault-169            [-1, 960, 2, 2]               0
          Conv2d-170            [-1, 960, 2, 2]           8,640
     BatchNorm2d-171            [-1, 960, 2, 2]           1,920
           ReLU6-172            [-1, 960, 2, 2]               0
           Fault-173            [-1, 960, 2, 2]               0
          Conv2d-174            [-1, 160, 2, 2]         153,600
     BatchNorm2d-175            [-1, 160, 2, 2]             320
InvertedResidual-176            [-1, 160, 2, 2]               0
          Conv2d-177            [-1, 960, 2, 2]         153,600
     BatchNorm2d-178            [-1, 960, 2, 2]           1,920
           ReLU6-179            [-1, 960, 2, 2]               0
           Fault-180            [-1, 960, 2, 2]               0
          Conv2d-181            [-1, 960, 2, 2]           8,640
     BatchNorm2d-182            [-1, 960, 2, 2]           1,920
           ReLU6-183            [-1, 960, 2, 2]               0
           Fault-184            [-1, 960, 2, 2]               0
          Conv2d-185            [-1, 320, 2, 2]         307,200
     BatchNorm2d-186            [-1, 320, 2, 2]             640
InvertedResidual-187            [-1, 320, 2, 2]               0
          Conv2d-188           [-1, 1280, 2, 2]         409,600
     BatchNorm2d-189           [-1, 1280, 2, 2]           2,560
           ReLU6-190           [-1, 1280, 2, 2]               0
           Fault-191           [-1, 1280, 2, 2]               0
         Dropout-192                 [-1, 1280]               0
          Linear-193                   [-1, 10]          12,810
================================================================
Total params: 2,236,682
Trainable params: 2,236,682
Non-trainable params: 0